1c-configuration-manager/src/InformationRegisters/НастройкиМеханизмаИзмененийКонфигураций/НастройкиМеханизмаИзмененийКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиМеханизмаИзмененийКонфигураций</name>
  <resources>
    <name>ЗначениеЧисло</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеБулево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеСтрока</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>CatalogRef.КлючиНастроекОбработкиДанных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c-configuration-manager/src/InformationRegisters/НастройкиМеханизмаИзмененийКонфигураций/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостьюСвойств();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюСвойств()     
	
	Если НЕ ЗначениеЗаполнено(Запись.Ключ) Тогда
		Возврат;
	КонецЕсли;
	
	МРез = ОбщегоНазначенияВызовСервера.ЗначенияРеквизитовОбъекта(Запись.Ключ,"ЭтоЧисло,ЭтоСтрока,ЭтоБулево");
	
	Элементы.ЗначениеБулево.Видимость = МРез.ЭтоБулево;
	Элементы.ЗначениеЧисло.Видимость = МРез.ЭтоЧисло;
	Элементы.ЗначениеСтрока.Видимость = МРез.ЭтоСтрока;
	
КонецПроцедуры

&НаКлиенте
Процедура КлючПриИзменении(Элемент)
	УправлениеВидимостьюСвойств();
КонецПроцедуры
